app/controllers/comments_controller.rb

	def create
		@question = Question.find(params[:question_id])

		@comment = Comment.new(comment_params)

		@comment.question = @question

		if @comment.save
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
INSERT INTO "comments" ("title", "question_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"