app/controllers/questions_controller.rb

	def index
		@questions = Question.all.order("created_at DESC")
---
SELECT "questions".* FROM "questions" ORDER BY created_at DESC

	def show
		@question = Question.find(params[:id])
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

	def create
		@question = Question.new(question_params)
		if @question.save
---
INSERT INTO "questions" ("title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "d"], ["description", "d"], ["created_at", 2017-02-28 17:43:47 UTC], ["updated_at", 2017-02-28 17:43:47 UTC]]

	def edit
		@question = Question.find(params[:id])
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]

	def update
		@question = Question.find(params[:id])
		if @question.update(question_params)
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
UPDATE "questions" SET "title" = $1, "description" = $2, "updated_at" = $3 WHERE "questions"."id" = $4

	def destroy
		@question = Question.find(params[:id])
		@question.destroy
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
DELETE FROM "questions" WHERE "questions"."id" = $1  [["id", 15]]